import os
import discord
from discord.ext import commands

intents = discord.Intents.default()
intents.message_content = True

bot = commands.Bot(command_prefix="!", intents=intents)

@bot.command()
@commands.has_role(1554391694068420728)
async def rules(ctx):
    rules_description = (
        "**1 - يمنع السب والشتـم او الالفاظ السيئة**\n\n"
        "**2 - يمنع التجارة بجميع الطرق**\n\n"
        "**3 - يمنع الاعلان لأي سيرفر او متجر**\n\n"
        "**4 - يمنع الاعلان لأي حساب تجاري او خاص**\n\n"
        "**5 - يمنع التطرق لمواضيع سياسية او دينية**\n\n"
        "**6 - يمنع نشر صور مخله بالأدب او وضعها بجميع الطرق**\n\n"
        "**7 - يمنع نشر المقاطع المخله بالأدب ومقاطع الالحاد**\n\n"
        "**8 - يمنع تشفير الكلمات بجميع الطرق ( تنبيه : مهما كانت نيتك صافية او سيئة دامك شفرت انت بتتحاسب )**\n\n"
        "**9 - يمنع نشر الروابط**\n\n"
        "**10 - يمنع طلب المال بالالعاب او بالواقع ( التسول )**\n\n"
        "**11 - يمنع العنصريه مهما كانت الاسباب (بشرة/ديانه/فلوس/طريقة كلام/امراض/والخ)**\n\n"
        "**12 - يمنع طلب رتبه**\n\n"
        "**13 - يمنع ازعاج الادارة العليا الا للضرورة القصوى**\n\n"
        "**14 - يمنع السبام بجميع الطرق**\n\n"
        "**15 - يمنع التشبه بالنساء ( والعكس كذلك )**\n\n"
        "**16 - يرجى التقييد بتخصص الرومات**\n\n"
        "**17 - يمنع مشاركة صور خاصة / فضايح / معلومات خاصة تعرضك للباند اغلب الاحيان**\n\n"
        "**18 - يمنع التشهير**\n\n"
        "**19 - يمنع ذكر اسامي سيرفرات اخرى داخل السيرفر**\n\n"
        "**20 - يمنع انتحال الشخصية بالمزح او غيره**\n\n"
        "**21 - يمنع فتح المايك ( للبنات ) في رومات تتضمن عيال**\n\n"
        "**--------------------------------------------------------**\n\n"
        "## تحذير\n\n"
        "**1 - عدم قراءتك للقوانين ليس عذر ولا تبرير نافع**\n\n"
        "**2 - المسؤول الاول هو الشخص الذي افتعل المشكلة منذ البداية**\n\n"
        "**3 - الاستهبال بالمواضيع الجدية يعرضك لزيادة العقوبة**"
    )

    my_embed = discord.Embed(
        title="### القوانين | Rules",
        description=rules_description,
        color=discord.Color.dark_grey()
    )

    my_embed.set_image(url="https://cdn.discordapp.com/attachments/1555159023924289536/1555171435432124476/1790756933339.jpg?backend=b2&ex=6abf8dc3&is=6abe3c43&hm=86d6dc594bee62e9d3a9c9706f180890058761bd8837c833db3e6706f7b2f6db&")
    my_embed.set_footer(text="by zilks  المز")

    await ctx.send(embed=my_embed)

@rules.error
async def rules_error(ctx, error):
    if isinstance(error, commands.MissingRole):
        await ctx.send("ماعندك صلاحية يغالي")

# يقرأ التوكن من المتغيرات البيئية بأمان
TOKEN = os.getenv("BOT_TOKEN")
bot.run(TOKEN)
